trade_exp/src/InformationRegisters/ШтрихкодыПоСекциямДокумента/ШтрихкодыПоСекциямДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="29531af2-dba3-42ad-9c7b-151933be8b21">
  <name>ШтрихкодыПоСекциямДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="c3fedc95-0bd1-421a-ad42-ed63e3217997">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fd209668-9498-4546-b274-099b5d89c19b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1c7dae82-7a35-419b-b8a5-0e1eb74689fc">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="88471c71-e486-452f-9ae2-871decbd42a1">
    <name>ДатаФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="01df1321-4602-41fe-ab9e-f0664ac3ee8e">
    <name>Проверен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ecc0fbe7-2de8-43e0-a093-25a7bb457aa0">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="3a52a111-7ca0-4772-889b-7605de702891">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="de290d7b-89b5-474a-804d-6b8a1415bf4d">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/УчетВремениВодителей/УчетВремениВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7348e1c5-fbfc-4442-9567-6688fe86d6b4">
  <name>УчетВремениВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="8b5b6d24-2959-498a-a73e-3d33af9e2ae8">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="efba3c4e-bfc2-41ae-a91a-cdab600655c7">
    <name>ВидЗанятости</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="9278f26b-7efe-462f-85cf-ea782d387ec0">
    <name>НужнаКорректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="9112465b-0cbe-4edf-bf2d-0b8669512abb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f18aed0c-6f6c-4642-b660-cc645c0249dc">
    <name>НачалоОтсчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="ec53027c-71c3-41a0-a6be-2e7e77f35ab3">
    <name>КонецОтсчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ИсторияДоступа/ИсторияДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="32cac9b3-ae6b-4910-a190-eb09b563dd2e">
  <name>ИсторияДоступа</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="f854b50d-b2a2-49f4-9700-7fb74d83073a">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a6407727-3992-4e5a-b790-d60c98a8142f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9952a41b-07b8-481a-a255-fb5b95356519">
    <name>ТребуетсяПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd2a6ea3-7fd0-47b6-b679-c23b2da25507">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2c650d20-0b87-4501-af70-8003f8aec615">
    <name>ЦельПосещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0d0b80b-72a0-4188-8a76-a512cfcb3b5c">
    <name>ТипСканераКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cac5493c-805c-4ac9-bf52-13fdeb63d4fb">
    <name>РезультатСканированияКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="fff676fd-7266-4f3d-aa5f-01692611efcb">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51660afc-e03f-4efd-b192-27ff9ed7be7e">
    <name>ЗонаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f7fba3d7-17e4-4fb7-9502-2fbc431f94c2">
    <name>Датчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1fa77aff-d589-4a53-9548-7872c980796e">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостояниеОтгрузкиДокумента/СостояниеОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6e2a290-cbc8-4936-bbb2-90e8d1c0db51">
  <name>СостояниеОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="dffce7aa-5f60-4a23-8318-5410c67632ff">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1cc5b099-9bfb-4b1e-8a24-a86abbfec9a4">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4a9099ca-f5d8-4382-a001-2e51e75cdaa1">
    <name>ОценкаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="46ae374e-4820-4eae-9365-1ccc6b8c5430">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d745fd3-8b9f-420d-a661-da3ab7a348d2">
    <name>НомерЗаезда</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="c260e72d-b1f0-4145-ad5d-b7ddd7768010">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f50361ea-5ef2-4f47-b334-48a3a4671d38">
    <name>Филиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13d75dc0-9223-4b1b-beb4-cba8132abe50">
  <name>УчетРабочегоВремениСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="a44913b0-4063-4968-bf34-b77f64254b83">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="54b7c3ee-5669-4057-b209-a361d67c8bad">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0d926621-4d7d-40ed-8fec-80d57c83437a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="58649832-c538-4ecf-98e0-7df52cfc2105">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/РезультатСканированияКПП/РезультатСканированияКПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2fb3f29c-cb3c-473f-9135-a2eda6c2ebfd">
  <name>РезультатСканированияКПП</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="4e5b4d75-c8ab-45e1-8558-e14c93a3e857">
    <name>ПовторноеСканирование</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7bb883e0-68d4-455e-b544-762f74fcd5d5">
    <name>ПовторныйВход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f76b270e-5c9b-4465-8a76-3730f32437c7">
    <name>ОбъектНеНайден</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52de1986-f064-431a-918c-9e107be52321">
    <name>НеНайденДатчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="290660b2-97d8-49da-9e5d-bcaa25c32dce">
    <name>НетДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b41016b5-5a34-4be3-9d5c-84fd4d8182c7">
    <name>ОбъектУдален</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="46eb4d85-0c0d-41a2-951c-c5a5c239defe">
    <name>ОбъектПросрочен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bd5abca4-95bb-48a7-8d68-1e48e337ffa5">
    <name>УспешныйВход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e057b567-ff21-4707-8aa0-86e14a1616ba">
    <name>УспешныйВыход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f31636f-5bae-457e-b481-131d3f9e75e6">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="91a95045-065b-4619-9711-1a31799bb76d">
    <name>СчитанШтрихкодНаСтойке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СостоянияСотрудников/СостоянияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5c9d146-8f4a-45db-9b47-dc1f6c9559b2">
  <name>СостоянияСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b343c276-8ae6-43f0-b8dc-6404f67693a2">
    <name>Зашел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="33217620-5c33-4012-bc80-e5f910792d19">
    <name>Вышел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonModules/УправлениеДоступомСервер/Module.bsl
Функция ОбработатьЗапросSKUD(Ид, Штрихкод, Датчик = Неопределено, Зона = Неопределено, ТипСканераКПП = неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Датчик) Тогда 
		Датчик = Справочники.ДатчикиСКУД.НайтиПоКоду(Ид, Истина);
		Если Датчик <> Справочники.ДатчикиСКУД.ПустаяСсылка() Тогда
			Зона = ПолучитьЗонуДоступаДатчика(Датчик);
		Иначе 
			Сообщить("Не найден датчик по ID: "+Ид);
			РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.НеНайденДатчик;
			Возврат РезультатСканированияКПП;
	КонецЕсли;
	КонецЕсли;     
	
	
	Результат = Неопределено;
	СсылкаДокумент = Неопределено; 
	
	Если Лев(Штрихкод, 4) = "8888" Тогда // Это сотрудник 
		Результат = ОбработатьСканированиеБейджикаСотрудника(Датчик, Зона, Штрихкод, ТипСканераКПП); 
	ИначеЕсли  Лев(Штрихкод, 4) = "9999" и СтрДлина(Штрихкод) = 14 Тогда // Это БейджВодителя 
		Результат = ОбработатьСканированиеБейджикаВодителя(Датчик, Зона, Штрихкод, ТипСканераКПП); 
	
	//Обрабатываем QR-код документа 
	ИначеЕсли Лев(Штрихкод,3) = "110" и СтрДлина(Штрихкод) = 14 Тогда //Это QR код 
		Если Лев(Штрихкод,4) = "1101" Тогда //Это разовый пропуск 
			СсылкаДокумент = ПолучитьДокументПоQRКоду("Пропуск", Штрихкод);			 
		КонецЕсли; 
		
		Если Лев(Штрихкод,4) = "1102" Тогда //Это заказ поставщику 
			СсылкаДокумент = ПолучитьДокументПоQRКоду("ЗаказПоставщику", Штрихкод); 
		КонецЕсли;      
		
		Если Лев(Штрихкод,4) = "1103" или Лев(Штрихкод,4) = "1104" Тогда //Это печать по секциям
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ШтрихкодыПоСекциямДокумента.Документ КАК Документ,
			|	ШтрихкодыПоСекциямДокумента.ДатаФормирования КАК ДатаФормирования
			|ИЗ
			|	РегистрСведений.ШтрихкодыПоСекциямДокумента КАК ШтрихкодыПоСекциямДокумента
			|ГДЕ
			|	ШтрихкодыПоСекциямДокумента.QRкод = &QRкод
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаФормирования УБЫВ";
			
			Запрос.УстановитьПараметр("QRкод", Штрихкод);
			
			Выборка = Запрос.Выполнить().Выбрать();	
			Если Выборка.Следующий() Тогда
				СсылкаДокумент = Выборка.Документ; 
			КонецЕсли;
			
		КонецЕсли;
		
		Если Лев(Штрихкод,4) = "1105" Тогда //Это рейс
			СсылкаДокумент = ПолучитьДокументПоQRКоду("ЗаданиеНаПеревозкуРейс", Штрихкод);
		КонецЕсли;		
		Если Лев(Штрихкод,4) = "1106" Тогда //Это печать по секциям
			СсылкаДокумент = ПолучитьДокументПоQRКоду("КорректировкаРеализации", Штрихкод);			
		КонецЕсли;
	КонецЕсли; 
	
	Если Результат = неопределено Тогда //Это документ. Бейджик уже был бы обработан 
		
		Если СсылкаДокумент = Неопределено Тогда //Отсканировали штрихкод
			МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод);
			Если МассивСсылок.Количество() = 0 Тогда //Не нашли ничего по отсканированной строке				
				Если СтрДлина(Штрихкод) = 14 Тогда 
					Комментарий = "На стойке считан штрихкод: " + Штрихкод;
					РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.СчитанШтрихкодНаСтойке; 
					ЗарегистрироватьСобытиеВИсторииДоступа("ОбъектНеНайден" , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
					Возврат РезультатСканированияКПП;	
				Иначе 
					Комментарий = "Документ не найден: " + Штрихкод;
					РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ОбъектНеНайден; 
					ЗарегистрироватьСобытиеВИсторииДоступа("ОбъектНеНайден" , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
					Возврат РезультатСканированияКПП; 
				КонецЕсли; 
			Иначе
				Документ = МассивСсылок[0];
			КонецЕсли;
		Иначе
			Документ = СсылкаДокумент; 
		КонецЕсли;
		
		ПоследняяЗапись = ПолучитьПоследнююЗаписьРегистраИсторияДосупа(Зона, Документ); 
		
		// Исключаем ошибочное сканирование
		Если ПоследняяЗапись.ДатаСобытия <> Неопределено Тогда
			Если ТекущаяДата()- ПоследняяЗапись.ДатаСобытия <= 60 Тогда
				РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ПовторноеСканирование;
				Возврат РезультатСканированияКПП;
			КонецЕсли;
		КонецЕсли;
							
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.Пропуск") Тогда	
			Результат = ОбработатьСканированиеПропуска(Документ, Датчик, Зона, Штрихкод, ТипСканераКПП); 	
		Иначе	
			Результат = ОбработатьСканированиеПечатнойФормыДокумента(Документ, Датчик, Зона, Штрихкод, ТипСканераКПП);	
		КонецЕсли;	
	
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);  
	
	
	Возврат Результат;
	
КонецФункции

#Область События
Функция ОбработатьСканированиеБейджикаСотрудника(Датчик, Зона, Штрихкод, ТипСканераКПП)
	
	//БЛОК ПРОВЕРОК 
	
	//Проверяем корректность бейджа
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
	Если Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Комментарий = "Не найден сотрудник: " + Штрихкод ;  
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ОбъектНеНайден; 
		ЗарегистрироватьСобытиеВИсторииДоступа("ОбъектНеНайден" , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	КонецЕсли;
	
	// Проверяем вхождение зоны доступа сотрудника в зону датчика
	Если ЗначениеЗаполнено(Сотрудник.УровеньДоступа) Тогда
		ЗоныДоступа = Сотрудник.УровеньДоступа.ЗоныДоступа.Выгрузить();
	Иначе 
		Если ЗначениеЗаполнено(Сотрудник.Отдел.УровеньДоступа)Тогда
			ЗоныДоступа = Сотрудник.Отдел.УровеньДоступа.ЗоныДоступа.Выгрузить();
		Иначе
			Комментарий = "Не найдена зона доступа сотрудника";
			РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.НетДоступа;
			ЗарегистрироватьСобытиеВИсторииДоступа(Сотрудник, Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
			Возврат РезультатСканированияКПП;
		КонецЕсли;
	КонецЕсли;
	
	ТЗ_ЗонаД = Новый ТаблицаЗначений();
	ТЗ_ЗонаД.Колонки.Добавить("ЗонаД");
	Для Каждого Стр Из ЗоныДоступа Цикл
		Если Зона = Стр.ЗонаДоступа Тогда 
			СтрокаТЗ = ТЗ_ЗонаД.Добавить();
			СтрокаТЗ.ЗонаД = Стр.ЗонаДоступа;
		КонецЕсли;
	КонецЦикла;
	
	Если ТЗ_ЗонаД.Количество() = 0 Тогда
		Комментарий = "Зона доступа сотрудника не входит в зону доступа датчика"; 
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.НетДоступа;
		ЗарегистрироватьСобытиеВИсторииДоступа(Сотрудник, Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	КонецЕсли; 
	
	
	//Проверяем не уволен ли сотрудник
	Если Сотрудник.Уволен Или Сотрудник.ПометкаУдаления Тогда
		Комментарий = "Сотрудник уволен"; 
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ОбъектУдален;
		ЗарегистрироватьСобытиеВИсторииДоступа(Сотрудник, Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	КонецЕсли; 
	
	//Проверяем на повторное сканирование
	ПоследняяЗапись = ПолучитьПоследнююЗаписьРегистраИсторияДосупа(Зона, Сотрудник); 
	Если ПоследняяЗапись.ДатаСобытия <> Неопределено Тогда 
		Если (ТекущаяДата() - ПоследняяЗапись.ДатаСобытия) <= 60 Тогда
			Комментарий = "Повторное сканирование"; 
			РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ПовторноеСканирование;
			ЗарегистрироватьСобытиеВИсторииДоступа(Сотрудник, Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
			Возврат РезультатСканированияКПП;	
		КонецЕсли; 
	КонецЕсли; 
	
	//Определяем ВходВыход
	Если ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВъезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Вход; 
		СобытиеДляТабеля = Перечисления.СостоянияСотрудников.Зашел;
	ИначеЕсли ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВыезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Выход; 
		СобытиеДляТабеля = Перечисления.СостоянияСотрудников.Вышел;
	Иначе //Ручной или стационарный для сотрудников
		Если ПоследняяЗапись.ДатаСобытия = Неопределено Тогда //Сотрудник впервые отсканировался 
			Событие = Перечисления.СобытиеСКУД.Вход; 
			СобытиеДляТабеля = Перечисления.СостоянияСотрудников.Зашел;
		Иначе
			Если НачалоДня(ПоследняяЗапись.ДатаСобытия) < НачалоДня(ТекущаяДата()) Тогда //Последнее событие было вчера
				Событие = Перечисления.СобытиеСКУД.Вход; 
				СобытиеДляТабеля = Перечисления.СостоянияСотрудников.Зашел;
			Иначе
				// Общая проверка
				Если  ПоследняяЗапись.Событие = Перечисления.СобытиеСКУД.Выход Тогда // Вышел или ещё не было
					Событие = Перечисления.СобытиеСКУД.Вход; 
					СобытиеДляТабеля = Перечисления.СостоянияСотрудников.Зашел;
				Иначе
					Событие = Перечисления.СобытиеСКУД.Выход; 
					СобытиеДляТабеля = Перечисления.СостоянияСотрудников.Вышел;
				КонецЕсли;
			КонецЕсли;    
		КонецЕсли;
	КонецЕсли; 
		
	Если Датчик.УчитыватьВТабеле Тогда
		//Добавляем запись о входе или выходе в регистр УчетРабочегоВремениСотрудников
		ЗарегистрироватьСобытиеВУчетеРабочегоВремениСотрудников(Сотрудник, СобытиеДляТабеля);
	КонецЕсли;
	
	//Фиксируем результат сканирования.
	Комментарий = ""; 
	Если Событие = Перечисления.СобытиеСКУД.Вход Тогда 
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВход; 
	Иначе
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВыход;   
	КонецЕсли;    
	
	Если Сотрудник.Водитель Тогда 
		Если ВодительОбслуживаетТС(Сотрудник,Перечисления.ВидЗанятостиВодителей.ОбслуживаниеТС) Тогда 
			ОбновитьЗаписьВодителя(Сотрудник, Неопределено, Перечисления.ВидЗанятостиВодителей.ОбслуживаниеТС); 
		Иначе
			СоздатьЗаписьВодителя(Сотрудник, Неопределено, Перечисления.ВидЗанятостиВодителей.ОбслуживаниеТС, ""); 
		КонецЕсли;
	КонецЕсли;

	//Регистрируем успешный входВыход в истории доступа
	ЗарегистрироватьСобытиеВИсторииДоступа(Сотрудник, Датчик, Зона, Событие, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
	Возврат РезультатСканированияКПП;
	
КонецФункции    

функция ВодительОбслуживаетТС(Водитель, ВидЗанятости)  
	Запрос = Новый Запрос; 
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	УчетВремениВодителей.Период КАК Период,
	                |	УчетВремениВодителей.Водитель КАК Водитель,
	                |	УчетВремениВодителей.КонецОтсчета КАК КонецОтсчета,
	                |	УчетВремениВодителей.НачалоОтсчета КАК НачалоОтсчета,
	                |	УчетВремениВодителей.ТранспортноеСредство КАК ТранспортноеСредство,
	                |	УчетВремениВодителей.ВидЗанятости КАК ВидЗанятости,
	                |	УчетВремениВодителей.ОснованиеВремени КАК ОснованиеВремени,
	                |	УчетВремениВодителей.Комментарий КАК Комментарий,
	                |	УчетВремениВодителей.НужнаКорректировка КАК НужнаКорректировка
	                |ИЗ
	                |	РегистрСведений.УчетВремениВодителей КАК УчетВремениВодителей
	                |ГДЕ
	                |	УчетВремениВодителей.ВидЗанятости = &ВидЗанятости 
	                |	И УчетВремениВодителей.Водитель = &Водитель 
					|	И УчетВремениВодителей.НужнаКорректировка = ИСтина
					|	И УчетВремениВодителей.Период >= &Период
					|
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ"; 
					
	Запрос.УстановитьПараметр("Водитель", Водитель);  
	Запрос.УстановитьПараметр("ВидЗанятости", ВидЗанятости);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Истина; 
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ОбработатьСканированиеБейджикаВодителя(Датчик, Зона, Штрихкод, ТипСканераКПП)
 
	// Ищем водителя
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	                 |	Сотрудники.Ссылка КАК Ссылка,
	                 |	СотрудникиБейджыВодителя.Наименование КАК Наименование,
					 |	СотрудникиБейджыВодителя.ТранспортноеСредство КАК ТранспортноеСредство
	                 |ИЗ
	                 |	Справочник.Сотрудники.БейджыВодителя КАК СотрудникиБейджыВодителя
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	                 |		ПО СотрудникиБейджыВодителя.Ссылка = Сотрудники.Ссылка
	                 |ГДЕ
	                 |	СотрудникиБейджыВодителя.Штрихкод = &Штрихкод" ; 
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод); 
	Выборка = ЗАпрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Сотрудник = Выборка.Ссылка; 
		ВодительТС = Выборка.Наименование;
		ТранспортноеСредство = ВЫборка.ТранспортноеСредство; 
	Иначе
		Комментарий = "Не найден сотрудник: " + Штрихкод;  
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ОбъектНеНайден; 
		ЗарегистрироватьСобытиеВИсторииДоступа("ОбъектНеНайден" , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	КонецЕсли;
	
	//ПолучаемПоследнююЗапись
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	                |	УчетВремениВодителей.Период КАК Период,
	                |	УчетВремениВодителей.Водитель КАК Водитель,
	                |	УчетВремениВодителей.КонецОтсчета КАК КонецОтсчета,
	                |	УчетВремениВодителей.НачалоОтсчета КАК НачалоОтсчета,
	                |	УчетВремениВодителей.ТранспортноеСредство КАК ТранспортноеСредство,
	                |	УчетВремениВодителей.ВидЗанятости КАК ВидЗанятости,
	                |	УчетВремениВодителей.ОснованиеВремени КАК ОснованиеВремени,
	                |	УчетВремениВодителей.Комментарий КАК Комментарий,
	                |	УчетВремениВодителей.НужнаКорректировка КАК НужнаКорректировка
	                |ИЗ
	                |	РегистрСведений.УчетВремениВодителей КАК УчетВремениВодителей
	                |ГДЕ
	                |	УчетВремениВодителей.ТранспортноеСредство = &ТранспортноеСредство 
	                |	И УчетВремениВодителей.Водитель = &Водитель  
					|	И УчетВремениВодителей.НужнаКорректировка = ИСтина
					|	И УчетВремениВодителей.Период >= &Период
					|
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ";
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	Запрос.УстановитьПараметр("Водитель", Сотрудник); 
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	
	Если не Выборка.Следующий() Тогда // Нет записей в регистре
		НачалоРейса = Истина; 
	Иначе
		НачалоРейса = Ложь;
	КонецЕсли; 
	
	//Регистрируем учет времени водителей 
	Если НачалоРейса Тогда 
		ВидЗанятости = Перечисления.ВидЗанятостиВодителей.Рейс;
		СоздатьЗаписьВодителя(Сотрудник, ТранспортноеСредство, ВидЗанятости, ""); 
	Иначе   
		ВидЗанятости = Перечисления.ВидЗанятостиВодителей.Рейс;
		ОбновитьЗаписьВодителя(Сотрудник, ТранспортноеСредство, ВидЗанятости);
	КонецЕсли;        
	
	//Определяем ВходВыход
	Если ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВъезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Вход; 
	ИначеЕсли ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВыезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Выход; 
	Иначе //Ручной или стационарный для сотрудников
		Если НачалоРейса Тогда //Сотрудник впервые отсканировался 
			Событие = Перечисления.СобытиеСКУД.Вход; 
		Иначе
			Событие = Перечисления.СобытиеСКУД.Выход;   
		КонецЕсли;
	КонецЕсли; 
			
	//Фиксируем результат сканирования.
	Комментарий = ""; 
	Если Событие = Перечисления.СобытиеСКУД.Вход Тогда 
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВход; 
	Иначе
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВыход;   
	КонецЕсли;    
	
	//Регистрируем успешный входВыход в истории доступа
	ЗарегистрироватьСобытиеВИсторииДоступа(Сотрудник, Датчик, Зона, Событие, РезультатСканированияКПП, ВодительТС, ТипСканераКПП);
	Возврат РезультатСканированияКПП;	
КонецФункции 

Процедура ОбновитьЗаписьВодителя(Водитель, ТранспортноеСредство, ВидЗанятости) 
	Запрос = Новый Запрос; 
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	УчетВремениВодителей.Период КАК Период,
	                |	УчетВремениВодителей.Водитель КАК Водитель,
	                |	УчетВремениВодителей.КонецОтсчета КАК КонецОтсчета,
	                |	УчетВремениВодителей.НачалоОтсчета КАК НачалоОтсчета,
	                |	УчетВремениВодителей.ТранспортноеСредство КАК ТранспортноеСредство,
	                |	УчетВремениВодителей.ВидЗанятости КАК ВидЗанятости,
	                |	УчетВремениВодителей.ОснованиеВремени КАК ОснованиеВремени,
	                |	УчетВремениВодителей.Комментарий КАК Комментарий,
	                |	УчетВремениВодителей.НужнаКорректировка КАК НужнаКорректировка
	                |ИЗ
	                |	РегистрСведений.УчетВремениВодителей КАК УчетВремениВодителей
	                |ГДЕ
	                |	УчетВремениВодителей.НужнаКорректировка = ИСТИНА
	                |	И УчетВремениВодителей.Водитель = &Водитель
	                |	И УчетВремениВодителей.ТранспортноеСредство = &ТранспортноеСредство   
					|	И УчетВремениВодителей.ВидЗанятости = &ВидЗанятости
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ"; 
					
	Запрос.УстановитьПараметр("Водитель", Водитель);  
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство); 
	Запрос.УстановитьПараметр("ВидЗанятости", ВидЗанятости);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
	
		УстановитьПривилегированныйРежим(Истина);
		УчетВремениВодителей = РегистрыСведений.УчетВремениВодителей;
		НаборЗапись = УчетВремениВодителей.СоздатьНаборЗаписей();
				 
		НаборЗапись.Отбор.Период.Установить(Выборка.Период);
		НаборЗапись.Отбор.Водитель.Установить(Выборка.Водитель); 
		НаборЗапись.Отбор.НачалоОтсчета.Установить(Выборка.НачалоОтсчета);
		НаборЗапись.Отбор.КонецОтсчета.Установить(Выборка.КонецОтсчета);
		НаборЗапись.Записать();
		 
		
		Запись = РегистрыСведений.УчетВремениВодителей.СоздатьМенеджерЗаписи();
		Запись.Период = Выборка.Период;  
		Запись.Водитель = Выборка.Водитель;
		Запись.НачалоОтсчета = Выборка.НачалоОтсчета;
		Запись.КонецОтсчета = дата('00010101') + (ТекущаяДата()-НачалоДня(ТекущаяДата()));
		Запись.ВидЗанятости = Выборка.ВидЗанятости;
		Запись.ТранспортноеСредство = Выборка.ТранспортноеСредство;
		Запись.ОснованиеВремени = Выборка.ОснованиеВремени;	
		Запись.НужнаКорректировка = Ложь;
		
		Запись.Записать(Истина);   
		УстановитьПривилегированныйРежим(Ложь);  
	КонецЕсли;
КонецПроцедуры
					
Процедура СоздатьЗаписьВодителя(Водитель, ТранспортноеСредство, ВидЗанятости, ОснованиеВремени)
	
	ЗакрытьУчетПоПоследнейЗаписиТекДня(Водитель); 
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.УчетВремениВодителей.СоздатьМенеджерЗаписи();
	Запись.Период = НачалоДня(ТекущаяДата());  
	Запись.Водитель = Водитель;
	Запись.НачалоОтсчета = дата('00010101') + (ТекущаяДата()-НачалоДня(ТекущаяДата()));
	Запись.КонецОтсчета = "";
	Запись.ВидЗанятости = ВидЗанятости;
	Запись.ТранспортноеСредство = ТранспортноеСредство;
	Запись.НужнаКорректировка = Истина; 
	Запись.ОснованиеВремени = ОснованиеВремени;	
	
	Запись.Записать(Истина);   
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	 

Процедура ЗакрытьУчетПоПоследнейЗаписиТекДня(Водитель) 
	Запрос = Новый Запрос; 
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	УчетВремениВодителей.Период КАК Период,
	                |	УчетВремениВодителей.Водитель КАК Водитель,
	                |	УчетВремениВодителей.КонецОтсчета КАК КонецОтсчета,
	                |	УчетВремениВодителей.НачалоОтсчета КАК НачалоОтсчета,
	                |	УчетВремениВодителей.ТранспортноеСредство КАК ТранспортноеСредство,
	                |	УчетВремениВодителей.ВидЗанятости КАК ВидЗанятости,
	                |	УчетВремениВодителей.ОснованиеВремени КАК ОснованиеВремени,
	                |	УчетВремениВодителей.Комментарий КАК Комментарий,
	                |	УчетВремениВодителей.НужнаКорректировка КАК НужнаКорректировка
	                |ИЗ
	                |	РегистрСведений.УчетВремениВодителей КАК УчетВремениВодителей
	                |ГДЕ
	                |	УчетВремениВодителей.НужнаКорректировка = ИСТИНА
	                |	И УчетВремениВодителей.Водитель = &Водитель  
					|	И УчетВремениВодителей.Период >= &Период 
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ"; 
					
	Запрос.УстановитьПараметр("Водитель", Водитель);  
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата())); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
	
		УстановитьПривилегированныйРежим(Истина);
		УчетВремениВодителей = РегистрыСведений.УчетВремениВодителей;
		НаборЗапись = УчетВремениВодителей.СоздатьНаборЗаписей();
				 
		НаборЗапись.Отбор.Период.Установить(Выборка.Период);
		НаборЗапись.Отбор.Водитель.Установить(Выборка.Водитель); 
		НаборЗапись.Отбор.НачалоОтсчета.Установить(Выборка.НачалоОтсчета);
		НаборЗапись.Отбор.КонецОтсчета.Установить(Выборка.КонецОтсчета);
		НаборЗапись.Записать();
		 
		
		Запись = РегистрыСведений.УчетВремениВодителей.СоздатьМенеджерЗаписи();
		Запись.Период = Выборка.Период;  
		Запись.Водитель = Выборка.Водитель;
		Запись.НачалоОтсчета = Выборка.НачалоОтсчета;
		Запись.КонецОтсчета = дата('00010101') + (ТекущаяДата()-НачалоДня(ТекущаяДата()));
		Запись.ВидЗанятости = Выборка.ВидЗанятости;
		Запись.ТранспортноеСредство = Выборка.ТранспортноеСредство;
		Запись.ОснованиеВремени = Выборка.ОснованиеВремени;	
		Запись.НужнаКорректировка = Ложь;
		
		Запись.Записать(Истина);   
		УстановитьПривилегированныйРежим(Ложь);  
	КонецЕсли;     
КонецПроцедуры
	
Процедура ВнестиВТабельВнутреннегоВодителяРейсОтПоставщика(Ссылка)  
	Рейс = ПолучитьРейсОтПоставщика(Ссылка); 
	Если Рейс <> неопределено и ТипЗнч(Рейс) = Тип("ДокументСсылка.РейсОтПоставщика") Тогда  
		Запрос = Новый запрос; 
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                    |	Сотрудники.Ссылка КАК Ссылка,
                    |	РейсОтПоставщика.Автомобиль КАК Автомобиль,
					|	РейсОтПоставщика.Статус КАК Статус
                    |ИЗ
                    |	Документ.РейсОтПоставщика КАК РейсОтПоставщика
                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
                    |		ПО РейсОтПоставщика.Водитель.Наименование = Сотрудники.Наименование
                    |ГДЕ
                    |	РейсОтПоставщика.Ссылка = &Ссылка
                    |	И Сотрудники.Водитель = ИСТИНА"; 
		Запрос.УстановитьПараметр("Ссылка", Рейс); 
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий() Тогда  
			Погрузка = Перечисления.ВидЗанятостиВодителей.Погрузка;
			Если не НашВодительОтПоставщикаНаСкладе(Рейс, Выборка.Ссылка)  Тогда 
				СоздатьЗаписьВодителя(Выборка.Ссылка, Выборка.Автомобиль, Погрузка, Рейс); 
			Иначе 
				ОбновитьЗаписьВодителя(Выборка.Ссылка, Выборка.Автомобиль, Погрузка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

функция НашВодительОтПоставщикаНаСкладе(Рейс, Водитель)  
	Запрос = Новый Запрос; 
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	УчетВремениВодителей.Период КАК Период,
	                |	УчетВремениВодителей.Водитель КАК Водитель,
	                |	УчетВремениВодителей.КонецОтсчета КАК КонецОтсчета,
	                |	УчетВремениВодителей.НачалоОтсчета КАК НачалоОтсчета,
	                |	УчетВремениВодителей.ТранспортноеСредство КАК ТранспортноеСредство,
	                |	УчетВремениВодителей.ВидЗанятости КАК ВидЗанятости,
	                |	УчетВремениВодителей.ОснованиеВремени КАК ОснованиеВремени,
	                |	УчетВремениВодителей.Комментарий КАК Комментарий,
	                |	УчетВремениВодителей.НужнаКорректировка КАК НужнаКорректировка
	                |ИЗ
	                |	РегистрСведений.УчетВремениВодителей КАК УчетВремениВодителей
	                |ГДЕ
	                |	УчетВремениВодителей.ОснованиеВремени = &Рейс 
	                |	И УчетВремениВодителей.Водитель = &Водитель  
					|
	                |УПОРЯДОЧИТЬ ПО
	                |	Период УБЫВ"; 
					
	Запрос.УстановитьПараметр("Водитель", Водитель);  
	Запрос.УстановитьПараметр("Рейс", Рейс); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Истина; 
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура ВнестиВТабельВнутреннегоВодителя(Ссылка) 
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
                    |	Сотрудники.Ссылка КАК Ссылка,
                    |	ЗаданиеНаПеревозкуРейс.Автомобиль КАК Автомобиль,
					|	ЗаданиеНаПеревозкуРейс.Статус КАК Статус
                    |ИЗ
                    |	Документ.ЗаданиеНаПеревозкуРейс КАК ЗаданиеНаПеревозкуРейс
                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
                    |		ПО ЗаданиеНаПеревозкуРейс.Водитель.Наименование = Сотрудники.Наименование
                    |ГДЕ
                    |	ЗаданиеНаПеревозкуРейс.Ссылка = &Ссылка
                    |	И Сотрудники.Водитель = ИСТИНА"; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
		Погрузка = Перечисления.ВидЗанятостиВодителей.Погрузка;
		Рейс = Перечисления.ВидЗанятостиВодителей.Рейс;  
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсторияДоступа.Событие КАК Событие,
		|	ИсторияДоступа.ДатаСобытия КАК ДатаСобытия
		|ИЗ
		|	РегистрСведений.ИсторияДоступа КАК ИсторияДоступа
		|ГДЕ
		|	ИсторияДоступа.Объект = &Объект
		|	И ИсторияДоступа.Событие <> ЗНАЧЕНИЕ(Перечисление.СобытиеСКУД.Отказ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытия УБЫВ";
		Запрос.УстановитьПараметр("Объект", Ссылка);

		Результат = Запрос.Выполнить();
		ВыборкаРезультатов = Результат.Выбрать();
		Если не ВыборкаРезультатов.Следующий() Тогда
			СоздатьЗаписьВодителя(Выборка.Ссылка, Выборка.Автомобиль, Погрузка, Ссылка); 
		Иначе  
			ОбновитьЗаписьВодителя(Выборка.Ссылка, Выборка.Автомобиль, Погрузка);
			СоздатьЗаписьВодителя(Выборка.Ссылка, Выборка.Автомобиль, Рейс, Ссылка);
		КонецЕсли;
	КонецЕсли; 
	  
КонецПроцедуры

Функция ОбработатьСканированиеПропуска(Документ, Датчик, Зона, Штрихкод, ТипСканераКПП) 
		
	Если Документ.Прекращен Тогда 
		Комментарий = "Действие пропуска прекращено";  
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ОбъектПросрочен; 
		ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	ИначеЕсли НЕ(ТекущаяДата() >= Документ.ДатаНачала И ТекущаяДата() <= Документ.ДатаОкончания) Тогда
		Комментарий = "Текущая дата не входит в период действия пропуска";  
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ОбъектПросрочен; 
		ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;	
	ИначеЕсли Зона <> Документ.Доступ Тогда
		Комментарий = "Зона доступа документа не входит в зону доступа датчика";  
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.НетДоступа; 
		ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	КонецЕсли;

	//Проверяем на повторное использование пропуска
	Если Документ.ТипПропуска = Перечисления.ТипыПропусков.Разовый Тогда
		// Проверяем был ли выход по регистру «История доступа»
		БылВыход = ПроверитьВыходВИсторииДоступа(Документ, Зона);
		Если БылВыход Тогда 
			Комментарий = "Повторный вход";  
			РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ПовторныйВход; 
			ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
			Возврат РезультатСканированияКПП;
		КонецЕсли;
	КонецЕсли;
	
	//Проверяем на повторное сканирование пропуска
	ПоследняяЗапись = ПолучитьПоследнююЗаписьРегистраИсторияДосупа(Зона, Документ); 
	Если ПоследняяЗапись.ДатаСобытия <> Неопределено Тогда 
		Если (ТекущаяДата() - ПоследняяЗапись.ДатаСобытия) <= 60 Тогда
			Комментарий = "Повторное сканирование"; 
			РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ПовторноеСканирование;
			ЗарегистрироватьСобытиеВИсторииДоступа(Документ, Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
			Возврат РезультатСканированияКПП;	
		КонецЕсли; 
	КонецЕсли;
	
	//Определяем ВходВыход
	Если ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВъезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Вход; 
	ИначеЕсли ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВыезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Выход; 
	Иначе //Ручной или стационарный для сотрудников
		Если ПоследняяЗапись.ДатаСобытия = Неопределено Тогда //Сотрудник впервые отсканировался 
			Событие = Перечисления.СобытиеСКУД.Вход; 
		Иначе
			Если НачалоДня(ПоследняяЗапись.ДатаСобытия) < НачалоДня(ТекущаяДата()) Тогда //Последнее событие было вчера
				Событие = Перечисления.СобытиеСКУД.Вход; 
			Иначе
				// Общая проверка
				Если  ПоследняяЗапись.Событие = Перечисления.СобытиеСКУД.Выход Тогда // Вышел или ещё не было
					Событие = Перечисления.СобытиеСКУД.Вход; 
				Иначе
					Событие = Перечисления.СобытиеСКУД.Выход; 
				КонецЕсли;
			КонецЕсли;    
		КонецЕсли;
	КонецЕсли;
	
	Комментарий = "";
	Если Событие = Перечисления.СобытиеСКУД.Вход Тогда 
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВход; 
	Иначе
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВыход;   
	КонецЕсли;
	ЗарегистрироватьСобытиеВИсторииДоступа(Документ, Датчик, Зона, Событие,РезультатСканированияКПП, Комментарий, ТипСканераКПП);
	Состояние = ?(Событие = Перечисления.СобытиеСКУД.Вход, Перечисления.СостоянияОтгрузкиДокумента.Заехал, Перечисления.СостоянияОтгрузкиДокумента.Выехал); 
	РегистрацияСостояния(Документ, Состояние, Штрихкод, Неопределено);
	Возврат РезультатСканированияКПП;
	
КонецФункции

Функция ОбработатьСканированиеПечатнойФормыДокумента(Документ, Датчик, Зона, Штрихкод, ТипСканераКПП)
	
	Если Зона <> Документ.Подразделение.ЗонаДоступа Тогда
		Комментарий = "Зона доступа документа не входит в зону доступа датчика";  
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.НетДоступа; 
		ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	КонецЕсли;
	
	// Считаем что вход Одноразовый и проверяем был ли выход по регистру «История доступа»
	БылВыход = ПроверитьВыходВИсторииДоступа(Документ, Зона);
	Если БылВыход Тогда
		Комментарий = "Повторный вход";  
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ПовторныйВход; 
		ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
		Возврат РезультатСканированияКПП;
	КонецЕсли;
	
	//Проверяем на повторное сканирование документа
	ПоследняяЗапись = ПолучитьПоследнююЗаписьРегистраИсторияДосупа(Зона, Документ); 
	Если ПоследняяЗапись.ДатаСобытия <> Неопределено Тогда 
		Если (ТекущаяДата() - ПоследняяЗапись.ДатаСобытия) <= 60 Тогда
			Комментарий = "Повторное сканирование"; 
			РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.ПовторноеСканирование;
			ЗарегистрироватьСобытиеВИсторииДоступа(Документ, Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
			Возврат РезультатСканированияКПП;	
		КонецЕсли; 
	КонецЕсли;
	
	ТЗ_Документов = Новый ТаблицаЗначений();
	ТЗ_Документов.Колонки.Добавить("Документ");
	ТЗ_Документов.Колонки.Добавить("Штрихкод");
	ТЗ_Документов.Колонки.Добавить("Ошибка"); 	

	
	ЗаказыОтПоставщика = ПолучитьВсеЗаказыПоРейсуОтПоставщика(Документ);
	Если ЗначениеЗаполнено(ЗаказыОтПоставщика) Тогда
		Для Каждого Заказ Из ЗаказыОтПоставщика Цикл	
			ОбработатьДокументНаВъездВыезд(Заказ, Штрихкод, Ложь, ТЗ_Документов);
		КонецЦикла;
	Иначе
		ОбработатьДокументНаВъездВыезд(Документ, Штрихкод, ,ТЗ_Документов);
	КонецЕсли;	
	
	
	ТЗ_Ошибки = Новый ТаблицаЗначений();
	ТЗ_Ошибки.Колонки.Добавить("Документ");
	ТЗ_Ошибки.Колонки.Добавить("Ошибка"); 	
	
	Для Каждого Стр Из ТЗ_Документов Цикл
		Если Стр.Ошибка <> Неопределено Тогда
			Если Стр.Ошибка = "По заказу клиента нет реализации" Тогда  
				Комментарий = "По заказу клиента нет реализации";  
				РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.Ошибка; 
				ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Комментарий, ТипСканераКПП);
				Возврат РезультатСканированияКПП;
			КонецЕсли;
			СтрокаОшибки = ТЗ_Ошибки.Добавить();
			СтрокаОшибки.Документ = Стр.Документ;
			СтрокаОшибки.Ошибка = Стр.Ошибка;
		КонецЕсли;
	КонецЦикла;
	
  	Если ТЗ_Ошибки.Количество() > 0 Тогда
		Если Датчик.СКУД Тогда
			ТекстОшибки = "";
			Для Каждого Стр Из ТЗ_Ошибки Цикл
				ТекстОшибки = ТекстОшибки + Строка(Стр.Ошибка) + " " + Стр.Документ + "; "; 
			КонецЦикла; 
			РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.Ошибка; 
			ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, ТекстОшибки, ТипСканераКПП);
			Возврат РезультатСканированияКПП;	
		Иначе 
			Для Каждого Стр Из ТЗ_Документов Цикл
				Если Стр.Ошибка <> Неопределено Тогда
					РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.Ошибка; 
					ЗарегистрироватьСобытиеВИсторииДоступа(Документ , Датчик, Зона, Перечисления.СобытиеСКУД.Отказ, РезультатСканированияКПП, Стр.Ошибка, ТипСканераКПП);
					Возврат РезультатСканированияКПП;
				КонецЕсли;
				РегистрацияСостоянияЗаезда(Стр.Документ, Стр.Штрихкод, Стр.Ошибка);
			КонецЦикла;
		КонецЕсли;
	Иначе 
		Для Каждого Стр Из ТЗ_Документов Цикл
			РегистрацияСостоянияЗаезда(Стр.Документ, Стр.Штрихкод, Стр.Ошибка);
		КонецЦикла;
	КонецЕсли;
	                     
		
	//Определяем ВходВыход
	Если ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВъезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Вход; 
	ИначеЕсли ТипСканераКПП = Перечисления.ТипСканераКПП.СтационарныйВыезд Тогда 
		Событие = Перечисления.СобытиеСКУД.Выход; 
	Иначе //Ручной или стационарный для сотрудников
		Если ПоследняяЗапись.ДатаСобытия = Неопределено Тогда //Документ впервые отсканирован 
			Событие = Перечисления.СобытиеСКУД.Вход; 
		Иначе
			Событие = Перечисления.СобытиеСКУД.Выход;   
		КонецЕсли;
	КонецЕсли;
	
	Комментарий = "";           
	Если Событие = Перечисления.СобытиеСКУД.Вход Тогда 
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВход; 
	Иначе
		РезультатСканированияКПП = Перечисления.РезультатСканированияКПП.УспешныйВыход;   
	КонецЕсли; 
	
	Если (ТипЗНЧ(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗНЧ(Документ) = Тип("ДокументСсылка.ЧекККМ")) И Событие = Перечисления.СобытиеСКУД.Вход Тогда
		РегистрыСведений.ЭлектроннаяОчередьКлиентов.ПоставитьОтметкуКПП(Документ);
	КонецЕсли;
	
	ЗарегистрироватьСобытиеВИсторииДоступа(Документ, Датчик, Зона, Событие,РезультатСканированияКПП, Комментарий, ТипСканераКПП);
	Возврат РезультатСканированияКПП;
КонецФункции

#КонецОбласти

#Область РегистрацияВъездаВыезда
//ГЛАВНАЯ
Процедура ОбработатьДокументНаВъездВыезд(Ссылка, Штрихкод = "", ЭтоРейс = Ложь, ТЗ_Документов) Экспорт
	
	//Если машина на складе регестрируем выезд без проверок
	Если МашинаНаСкладе(Ссылка) Тогда
		РегистрацияСостоянияВыезда(Ссылка, Штрихкод);
		Возврат;
	КонецЕсли;
					
	//ОБРАБОТКА ДОКУМЕНТОВ			
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОбработатьРеализацию(Ссылка, Штрихкод, ЭтоРейс, ТЗ_Документов);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ОбработатьЧек(Ссылка, Штрихкод, ЭтоРейс, ТЗ_Документов);

	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
		ОбработатьЗаказПоставщику(Ссылка, Штрихкод, ТЗ_Документов);
		ВнестиВТабельВнутреннегоВодителяРейсОтПоставщика(Ссылка); 
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаданиеНаПеревозкуРейс") Тогда   
		ЗарегистрироватьСостояниеПоРейсу(Ссылка, Штрихкод, Истина, ТЗ_Документов);
		ВнестиВТабельВнутреннегоВодителя(Ссылка); 
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") 
		ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.БлокировкаДвиженияТоваров") 
		или ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОбращениеКлиента") или ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
		СтрокаТЗ = ТЗ_Документов.Добавить();
		СтрокаТЗ.Документ = Ссылка;	
		СтрокаТЗ.Штрихкод = Штрихкод;	
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда     
		ОбработатьЗаказКлиента(Ссылка, Штрихкод, ТЗ_Документов);
		
	Иначе
		Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.НеПредусмотренДляСканирования");
		СтрокаТЗ = ТЗ_Документов.Добавить();
		СтрокаТЗ.Документ = Ссылка;
		СтрокаТЗ.Ошибка = Ошибка;
	КонецЕсли;
		
КонецПроцедуры

//ОБРАБОТКА ДОКУМЕНТОВ
Функция ЗарегистрироватьСостояниеПоРейсу(Рейс, Штрихкод, ЭтоРейс = Ложь, ТЗ_Документов)
	
	мДокументовПродажи = ПолучитьДокументыПродажиСервер(Рейс);
	
	Для Каждого Ссылка Из мДокументовПродажи Цикл	
		ОбработатьДокументНаВъездВыезд(Ссылка, Штрихкод, ЭтоРейс, ТЗ_Документов);	
	КонецЦикла;
	
	УстановитьСтатусРейса(Рейс);

КонецФункции

Процедура УстановитьСтатусРейса(Ссылка)
	
	Рейс = Ссылка.ПолучитьОбъект();
	Если Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ДокументыНаПогрузкуГотовы") ИЛИ Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ВодительДокументыПолучил") Тогда
		Рейс.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСНаПогрузке");
	ИначеЕсли Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСНаПогрузке") Тогда
		Рейс.Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСВПути");
	КонецЕсли;
	Рейс.Записать(РежимЗаписиДокумента.Проведение);
	
	АльтерраОбщегоНазначения.УстановитьСтатусВодителю(Рейс.Водитель, Перечисления.СтатусыВодителей.ВРейсе, "установлен из КПП",, Рейс.Ссылка);
	
КонецПроцедуры

Процедура ОбработатьРеализацию(Ссылка, Штрихкод, ЭтоРейс = Ложь, ТЗ_Документов)
	
	Ошибка = Неопределено; 
	
	Если Не ЭтоРейс Тогда
		Рейс = ПолучитьРейс(Ссылка);
		Если ЗначениеЗаполнено(Рейс) Тогда
			Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДолженСканироватсяМаршрутныйЛист");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДокументОплачен(Ссылка) Тогда
		Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументНеОплачен");
	ИначеЕсли ДокументОтгружен(Ссылка) Тогда
		Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументПолностьюОтгружен");
	КонецЕсли;
		
	СтрокаТЗ = ТЗ_Документов.Добавить();
	СтрокаТЗ.Документ = Ссылка;
	СтрокаТЗ.Штрихкод = Штрихкод;
	СтрокаТЗ.Ошибка = Ошибка;
	
КонецПроцедуры

Процедура ОбработатьЧек(Ссылка, Штрихкод, ЭтоРейс = Ложь, ТЗ_Документов)
	
	Ошибка = Неопределено; 
	
	Если Не ЭтоРейс Тогда
		Рейс = ПолучитьРейс(Ссылка);
		Если ЗначениеЗаполнено(Рейс) Тогда
			Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДолженСканироватсяМаршрутныйЛист");
		КонецЕсли;
	КонецЕсли;

	Если Не ЧекПробит(Ссылка) Тогда
		Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументНеОплачен");
	ИначеЕсли ДокументОтгружен(Ссылка) Тогда
		Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ДокументПолностьюОтгружен");
	КонецЕсли;
	
	СтрокаТЗ = ТЗ_Документов.Добавить();
	СтрокаТЗ.Документ = Ссылка;
	СтрокаТЗ.Штрихкод = Штрихкод;
	СтрокаТЗ.Ошибка = Ошибка;

КонецПроцедуры

Процедура ОбработатьЗаказПоставщику(Ссылка, Штрихкод, ТЗ_Документов)

	Ошибка = Неопределено;
	СтатусДокумента = ПолучитьСтатус(Ссылка);
	Если СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПоставщикам.НеСогласован") ИЛИ СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПоставщикам.Закрыт") Тогда
		Ошибка = ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.СтатусЗаказаНеКПоступлению");
	КонецЕсли;
	
	СтрокаТЗ = ТЗ_Документов.Добавить();
	СтрокаТЗ.Документ = Ссылка;
	СтрокаТЗ.Штрихкод = Штрихкод;
	СтрокаТЗ.Ошибка = Ошибка;
		
КонецПроцедуры

Процедура ОбработатьЗаказКлиента(Ссылка, Штрихкод, ТЗ_Документов)
	
	мДокументовПродажи = ПолучитьДокументыПродажиСервер(Ссылка); 
	
	Если мДокументовПродажи.Количество() <= 1 Тогда
		СтрокаТЗ = ТЗ_Документов.Добавить();
		СтрокаТЗ.Документ = Ссылка;
		СтрокаТЗ.Штрихкод = Штрихкод;
		СтрокаТЗ.Ошибка = "По заказу клиента нет реализации";
	КонецЕсли;
	
	Для Каждого Ссылка Из мДокументовПродажи Цикл	
		ОбработатьДокументНаВъездВыезд(Ссылка, Штрихкод, , ТЗ_Документов);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ЗаписьВРегистр
Функция РегистрацияСостоянияЗаезда(Ссылка, Штрихкод = "", Ошибка = Неопределено)
	
	Если НЕ РегистрацияСостояния(Ссылка, Перечисления.СостоянияОтгрузкиДокумента.Заехал, Штрихкод, Ошибка) Тогда
		ЗафиксироватьОшибку(Ссылка, ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ОшибкаРегистрацииЗаезда"), Штрихкод);					;					
	КонецЕсли;
	
КонецФункции

Процедура РегистрацияСостоянияВыезда(Ссылка, Штрихкод = "", Ошибка = Неопределено)  
	
	Если ОшибочнаяРегистрацияНаВъезд(Ссылка) Тогда
		Возврат ;
	КонецЕсли;
	Если НЕ РегистрацияСостояния(Ссылка, Перечисления.СостоянияОтгрузкиДокумента.Выехал, Штрихкод, Ошибка) Тогда
		ЗафиксироватьОшибку(Ссылка, ПредопределенноеЗначение("Перечисление.ОшибкиНаКПП.ОшибкаРегистрацииВыезда"), Штрихкод);				
	КонецЕсли;
	
КонецПроцедуры

Функция РегистрацияСостояния(Ссылка, Состояние, Штрихкод = "", Ошибка)
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Истина;
	
	ДатаСобытия = ТекущаяДата() + 1 ;
	
	Запись = РегистрыСведений.СостояниеОтгрузкиДокумента.СоздатьМенеджерЗаписи();
	
	Запись.Документ	= Ссылка;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", Ссылка.Метаданные()) Тогда
		Запись.Филиал = Ссылка.Подразделение;
	КонецЕсли;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.БлокировкаДвиженияТоваров") Тогда
		Запись.Филиал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Склад,"Подразделение");
	КонецЕсли;
	Запись.Период = ДатаСобытия;	
	Запись.Состояние = Состояние;
	Запись.Штрихкод	= Штрихкод;
	Запись.Ошибка = Ошибка;
	Запись.НомерЗаезда = ПолучитьНомерЗаезда(Ссылка)+1;
	
	Попытка
		Запись.Записать(Ложь);
	Исключение
		Результат = Ложь;	
	КонецПопытки;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику")И Состояние = Перечисления.СостоянияОтгрузкиДокумента.Заехал Тогда
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		ДокументОбъект.ДатаОтгрузки = ДатаСобытия;
		ДокументОбъект.ДатаПоступления = ДокументОбъект.ДатаОтгрузки + ДокументОбъект.ДлительностьДоставки*86400;
		Для Каждого Товар Из ДокументОбъект.Товары Цикл
		    Товар.ДатаПоступления = ДокументОбъект.ДатаПоступления;
		    Товар.ДатаОтгрузки = ДокументОбъект.ДатаОтгрузки;
	    КонецЦикла;
 		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
 		Исключение
 		КонецПопытки;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции 

Функция РегистрацияСостоянияОшибка(Ссылка, Ошибка, Штрихкод = "")
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Истина;
	
	ДатаСобытия = ТекущаяДата();
	
	Запись = РегистрыСведений.СостояниеОтгрузкиДокумента.СоздатьМенеджерЗаписи();
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		Запись.Документ	= Ссылка;
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", Ссылка.Метаданные()) Тогда
			Запись.Филиал = Ссылка.Подразделение;
		КонецЕсли;
	КонецЕсли;
	Запись.Период = ДатаСобытия;	
	Запись.Состояние = Перечисления.СостоянияОтгрузкиДокумента.Ошибка;
	Запись.Ошибка = Ошибка;
	Запись.Штрихкод = Штрихкод;
	
	Попытка
		Запись.Записать(Ложь);
	Исключение
		Результат = Ложь;	
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомерЗаезда(Документ)

	МассивСтатусов = Новый Массив();
	МассивСтатусов.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Заехал);
	МассивСтатусов.Добавить(Перечисления.СостоянияОтгрузкиДокумента.Выехал);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОтгрузкиДокументаСрезПоследних.НомерЗаезда КАК НомерЗаезда
		|ИЗ
		|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(
		|			&Период,
		|			Документ = &Документ
		|				И Состояние В (&МассивСтатусов)) КАК СостояниеОтгрузкиДокументаСрезПоследних";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерЗаезда;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции 	
	
Процедура ЗафиксироватьОшибку(Ссылка, Ошибка, Штрихкод = "")
	
	РегистрацияСостоянияОшибка(Ссылка, Ошибка, Штрихкод);
	
КонецПроцедуры

Процедура ЗарегистрироватьСобытиеВУчетеРабочегоВремениСотрудников(Сотрудник, Событие)
	НаборЗаписей = РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Сотрудник = Сотрудник;
	НоваяЗапись.Пользователь = Сотрудник.Пользователь;
	НоваяЗапись.Подразделение = ?(ЗначениеЗаполнено(Сотрудник.Подразделение), Сотрудник.Подразделение, Сотрудник.Пользователь.ТекущееПодразделение);
	НоваяЗапись.Событие = Событие;

	НаборЗаписей.Записать(Ложь);	
КонецПроцедуры

Процедура ЗарегистрироватьСобытиеВИсторииДоступа(Объект = неопределено, Датчик, ЗонаДоступа, Событие, РезультатСканированияКПП, Комментарий, ТипСканераКПП) Экспорт
	НаборЗаписей = РегистрыСведений.ИсторияДоступа.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ДатаСобытия = ТекущаяДата();
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.Датчик = Датчик;  
	НоваяЗапись.ЗонаДоступа = ЗонаДоступа;
	НоваяЗапись.Событие = Событие;  
	НоваяЗапись.РезультатСканированияКПП = РезультатСканированияКПП;
	НоваяЗапись.ТипСканераКПП = ТипСканераКПП;
	НоваяЗапись.Комментарий = Комментарий;
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.Пропуск") Тогда
		НоваяЗапись.ФИО = Объект.ФИО;
		НоваяЗапись.ЦельПосещения = Объект.ЦельПосещения;
	КонецЕсли;
	
	НаборЗаписей.Записать(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции   

Функция ПолучитьДокументПоQRКоду(ТипДокумента, QRКод) 
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
			      |	Документ.Ссылка КАК Ссылка,
			      |	Документ.QRкод КАК QRкод,
			      |	Документ.Дата КАК Дата
			      |ИЗ
			      |	Документ.&ТипДокумента КАК Документ
			      |ГДЕ
			      |	Документ.QRкод = &QRкод
			      |
			      |УПОРЯДОЧИТЬ ПО
			      |	Дата УБЫВ"; 
	
	ТекстЗапроса = СтрЗАменить(ТекстЗапроса, "&ТипДокумента", ТипДокумента);
	
	Запрос.Текст = ТекстЗапроса; 
	Запрос.УстановитьПараметр("QRкод", QRкод); 
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка; 
	Иначе
		Возврат Неопределено; 
	КонецЕсли;	
	
КонецФункции

Функция ДокументОплачен(Ссылка)
	
	Возврат (Ссылка.Проведен И Не Ссылка.Кассир.Пустая()) Или ОплаченоНаКСО(Ссылка);
	
КонецФункции

Функция ЧекПробит(Ссылка)
	
	Возврат (Ссылка.Статус = Перечисления.СтатусыЧековККМ.Пробит) Или ОплаченоНаКСО(Ссылка);
	
КонецФункции    

Функция ОплаченоНаКСО(Ссылка)
	
	Запрос = Новый Запрос;  
	
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	&Ссылка	
		|ИЗ
		|	Документ.ЧекСамообслуживания       
		|ГДЕ 
		|	%Документ = &Ссылка	
		|	И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|	И ТипПродажи В (11, 21)
		|	И (ДатаОтправкиНаПробитие = ДАТАВРЕМЯ(1, 1, 1) 
		|		ИЛИ ДатаРезультатаПробития = ДАТАВРЕМЯ(1, 1, 1) 
		|		ИЛИ ОшибкаЗаписиДокумента <> &ПустаяСтрока)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Документ", ?(ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ"), "ЧекККМ", "Реализация"));
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");   
	
	Возврат Не Запрос.Выполнить().Пустой();
				
КонецФункции				

Функция ДокументОтгружен(Ссылка)
	
	флДокументОтгружен = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Кладовщик = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМТовары.Ссылка
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|ГДЕ
	|	ЧекККМТовары.Кладовщик = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ЧекККМТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		флДокументОтгружен = Ложь;
	КонецЕсли;
	
	Возврат флДокументОтгружен;
	
КонецФункции

Функция ПолучитьРейс(Ссылка)
	
	Рейс = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьРейсПоДокументуПродажи(Ссылка);
	Если ЗначениеЗаполнено(Рейс) Тогда
		Возврат Рейс;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДокументыПродажиСервер(Ссылка) Экспорт
	
	Перем мДокументовПродажи;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|   РеализацияТоваровУслуг.Проведен = Истина
		|	И РеализацияТоваровУслуг.ЗаказКлиента = &ЗаказКлиента";
		
		Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка);
		мДокументовПродажи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		мДокументовПродажи = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьДокументыПродажи(Ссылка);
	КонецЕсли;
	
	Возврат мДокументовПродажи;
	
КонецФункции

Функция ПолучитьСтатус(Ссылка)
	
	Возврат Ссылка.Статус;
	
КонецФункции

Функция ОшибочнаяРегистрацияНаВъезд(Документ)
	
	ТекущееВремя = ТекущаяДата();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОтгрузкиДокументаСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(
		|			&Период,
		|			Документ = &Документ
		|				И Состояние = &Статус) КАК СостояниеОтгрузкиДокументаСрезПоследних";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Период", ТекущееВремя);
	Запрос.УстановитьПараметр("Статус", Перечисления.СостоянияОтгрузкиДокумента.Заехал);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ?(ТекущееВремя - ВыборкаДетальныеЗаписи.Период <= 30, Истина, Ложь);
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция МашинаНаСкладе(Ссылка)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостояниеОтгрузкиДокументаСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.СостояниеОтгрузкиДокумента.СрезПоследних(, Документ = &Ссылка) КАК СостояниеОтгрузкиДокументаСрезПоследних
	|ГДЕ
	|	СостояниеОтгрузкиДокументаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Заехал)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗонуДоступаДатчика(Датчик) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗоныДоступаДатчики.Ссылка КАК ЗонаДоступа
	|ИЗ
	|	Справочник.ЗоныДоступа.Датчики КАК ЗоныДоступаДатчики
	|ГДЕ
	|	ЗоныДоступаДатчики.Датчик = &Датчик ";
	Запрос.УстановитьПараметр("Датчик", Датчик);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий(); 
	
	Возврат Выборка.ЗонаДоступа;
	
КонецФункции

Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод) 
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ВозвратТоваровОтКлиента.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЧекККМВозврат.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказПоставщику.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПеремещениеТоваров.ПустаяСсылка"));
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаданиеНаПеревозкуРейс.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказНаДоставкуКлиенту.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.БлокировкаДвиженияТоваров.ПустаяСсылка")); 
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.Пропуск.ПустаяСсылка"));      
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.КорректировкаРеализации.ПустаяСсылка"));
	
	Возврат ШтрихкодированиеПечатныхФормВызовСервера.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

Функция ПроверитьВыходВИсторииДоступа(Объект, ЗонаДоступа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияДоступа.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ИсторияДоступа КАК ИсторияДоступа
	|ГДЕ
	|	ИсторияДоступа.Объект = &Объект
	|	И ИсторияДоступа.ЗонаДоступа = &ЗонаДоступа
	|	И ИсторияДоступа.Событие = &Событие";
	Запрос.УстановитьПараметр("Объект", Объект);   
	Запрос.УстановитьПараметр("ЗонаДоступа", ЗонаДоступа);
	Запрос.УстановитьПараметр("Событие", Перечисления.СобытиеСКУД.Выход);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 	
КонецФункции

Функция ПолучитьПоследнююЗаписьРегистраИсторияДосупа(ЗонаДоступа, Объект)
	 			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияДоступа.Событие КАК Событие,
	|	ИсторияДоступа.ДатаСобытия КАК ДатаСобытия
	|ИЗ
	|	РегистрСведений.ИсторияДоступа КАК ИсторияДоступа
	|ГДЕ
	|	ИсторияДоступа.Объект = &Объект
	|	И ИсторияДоступа.ЗонаДоступа = &ЗонаДоступа
	|	И ИсторияДоступа.Событие <> ЗНАЧЕНИЕ(Перечисление.СобытиеСКУД.Отказ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия УБЫВ";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ЗонаДоступа", ЗонаДоступа);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

Функция ПолучитьРейсОтПоставщика(ЗаказПоставщику) 
		
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ
			|	Рейсы.Ссылка КАК Ссылка
			|ИЗ
			|	(ВЫБРАТЬ
			|		Рейс.Ссылка КАК Ссылка
			|	ИЗ
			|		Документ.РейсОтПоставщика.РасчетДоставки КАК Рейс
			|	ГДЕ
			|		Рейс.ДокументОснование = &ЗаказПоставщику
			|		И Рейс.Ссылка.Проведен
			|		И Рейс.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Рейс.Ссылка
			|	ИЗ
			|		Документ.РейсСиламиПоставщика.Основания КАК Рейс
			|	ГДЕ
			|		Рейс.Документ = &ЗаказПоставщику
			|		И Рейс.Ссылка.Проведен) КАК Рейсы
			|
			|СГРУППИРОВАТЬ ПО
			|	Рейсы.Ссылка
			|;";
		
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
			
	Выборка = Запрос.Выполнить().Выбрать();     

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка; 
	Иначе 
		Возврат Неопределено;  
	КонецЕсли;
КонецФункции

Функция ПолучитьВсеЗаказыПоРейсуОтПоставщика(ЗаказПоставщику) Экспорт	
	
	
	МассивЗаказов = Новый Массив;
	ПодразделениеТекущегоПользователя = ПользователиКлиентСервер.ТекущийПользователь().Подразделение;
	
	Если ЗначениеЗаполнено(ПодразделениеТекущегоПользователя) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Рейсы.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТРейсы
			|ИЗ
			|	(ВЫБРАТЬ
			|		Рейс.Ссылка КАК Ссылка
			|	ИЗ
			|		Документ.РейсОтПоставщика.РасчетДоставки КАК Рейс
			|	ГДЕ
			|		Рейс.ДокументОснование = &ЗаказПоставщику
			|		И Рейс.Ссылка.Проведен
			|		И Рейс.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Рейс.Ссылка
			|	ИЗ
			|		Документ.РейсСиламиПоставщика.Основания КАК Рейс
			|	ГДЕ
			|		Рейс.Документ = &ЗаказПоставщику
			|		И Рейс.Ссылка.Проведен) КАК Рейсы
			|
			|СГРУППИРОВАТЬ ПО
			|	Рейсы.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Рейс.ДокументОснование КАК Ссылка
			|ПОМЕСТИТЬ ВТЗаказы
			|ИЗ
			|	Документ.РейсОтПоставщика.РасчетДоставки КАК Рейс
			|ГДЕ
			|	Рейс.Ссылка В
			|			(ВЫБРАТЬ
			|				Рейсы.Ссылка
			|			ИЗ
			|				ВТРейсы КАК Рейсы)
			|	И Рейс.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
			|	И Рейс.ДокументОснование.Подразделение = &Подразделение
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Рейс.Документ
			|ИЗ
			|	Документ.РейсСиламиПоставщика.Основания КАК Рейс
			|ГДЕ
			|	Рейс.Ссылка В
			|			(ВЫБРАТЬ
			|				Рейсы.Ссылка
			|			ИЗ
			|				ВТРейсы КАК Рейсы)
			|	И Рейс.Документ.Подразделение = &Подразделение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(Рейсы.Ссылка) КАК Ссылка
			|ИЗ
			|	ВТРейсы КАК Рейсы
			|
			|СГРУППИРОВАТЬ ПО
			|	Рейсы.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Заказы.Ссылка КАК Ссылка
			|ИЗ
			|	ВТЗаказы КАК Заказы
			|
			|СГРУППИРОВАТЬ ПО
			|	Заказы.Ссылка";
		
		Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеТекущегоПользователя);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();     

		Выборка = МассивРезультатов[0].Выбрать();
		Если Выборка.Следующий() И Выборка.Количество > 0 Тогда
			Если Выборка.Количество > 1 Тогда
				Сообщение = "Найдено несколько рейсов по данному заказу:";
				
				Выборка = МассивРезультатов[2].Выбрать();
				Пока Выборка.Следующий() Цикл
					Сообщение = Сообщение + Символы.ПС + Выборка.Ссылка;
				КонецЦикла;
				
				ОбщегоНазначения.СообщитьПользователю(Сообщение);
			КонецЕсли;
			
			Выборка = МассивРезультатов[3].Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивЗаказов.Добавить(Выборка.Ссылка);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Необходимо указать подразделение для текущего пользователя!");
	КонецЕсли;

	Возврат МассивЗаказов; 
	
КонецФункции

#КонецОбласти
